<a href="https://colab.research.google.com/github/sahanal2603/Data-Science-and-Analytics/blob/master/Introduction_to_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
students = {'Name': ['Kan', 'Mani','Buddhi', 'Kanmani','Telecom','BMS'],
            'Age': [35, 45, 55, 44, 60,  63],
            'CGPA': [6.75, 3.45, 7.7, 9.0,  7.9, 6.8],
            'Data_Science': ['Yes', 'No', 'Yes','No', 'Yes','Yes']}

print(students)

{'Name': ['Kan', 'Mani', 'Buddhi', 'Kanmani', 'Telecom', 'BMS'], 'Age': [35, 45, 55, 44, 60, 63], 'CGPA': [6.75, 3.45, 7.7, 9.0, 7.9, 6.8], 'Data_Science': ['Yes', 'No', 'Yes', 'No', 'Yes', 'Yes']}

In [3]:
student_data =pd.DataFrame(students)
print(student_data)

      Name  Age  CGPA Data_Science
0      Kan   35  6.75          Yes
1     Mani   45  3.45           No
2   Buddhi   55  7.70          Yes
3  Kanmani   44  9.00           No
4  Telecom   60  7.90          Yes
5      BMS   63  6.80          Yes

In [4]:
student_data.columns

Index(['Name', 'Age', 'CGPA', 'Data_Science'], dtype='object')

In [5]:
round(student_data.CGPA.mean())

7

In [6]:
round(student_data.Age.mean(),2)

50.33

In [7]:
# to get various statistical parameters of CCGPA column

student_data.CGPA.agg(['mean','var','std','min','max'])

mean    6.933333
var     3.595667
std     1.896224
min     3.450000
max     9.000000
Name: CGPA, dtype: float64

In [8]:
student_data.Data_Science

0    Yes
1     No
2    Yes
3     No
4    Yes
5    Yes
Name: Data_Science, dtype: object

In [9]:
student_data.Data_Science.unique()

array(['Yes', 'No'], dtype=object)

In [10]:
student_data.Data_Science.nunique()

2

In [11]:
student_data.Data_Science.value_counts()

Yes    4
No     2
Name: Data_Science, dtype: int64

In [12]:
Know = student_data[student_data['Data_Science']=='Yes']
print(Know)

      Name  Age  CGPA Data_Science
0      Kan   35  6.75          Yes
2   Buddhi   55  7.70          Yes
4  Telecom   60  7.90          Yes
5      BMS   63  6.80          Yes

In [13]:
number_know=Know.shape[0]
print(number_know)

4

In [14]:
Dont_Know = student_data[student_data['Data_Science']=='No']
print(Dont_Know)

      Name  Age  CGPA Data_Science
1     Mani   45  3.45           No
3  Kanmani   44  9.00           No

In [15]:
number_Dont_know=Dont_Know.shape[0]
print(number_Dont_know)

2

In [16]:
prob_of_YES = number_know /(number_know + number_Dont_know)
print('Probability of YES = ', round(prob_of_YES,2))

prob_of_NO = number_Dont_know /(number_know + number_Dont_know)
print('Probability of NO = ',round(prob_of_NO,2))

Probability of YES =  0.67
Probability of NO =  0.33

In [17]:
student_data.describe()

             Age      CGPA
count   6.000000  6.000000
mean   50.333333  6.933333
std    10.764138  1.896224
min    35.000000  3.450000
25%    44.250000  6.762500
50%    50.000000  7.250000
75%    58.750000  7.850000
max    63.000000  9.000000

**This Uset Data is taken from the Tutorial session of the TEQIP III sponsored Faculty Development program, conducted by IIT Ghandinagar, during 11 to 23 January, 2021**

In [18]:
#This time we are going to pull the "Occupation" dataset directly from the internet. 
#Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

#Import the dataset from this address: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user
#Assign it to a variable called users and use the 'user_id' as index

users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

In [19]:
#See the first 5 entries
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [20]:
#See the last 10 entries

users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [21]:
#Print the name of all the columns.

users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [22]:
#What is the data type of each column?

users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [23]:
users.shape[1]

4

In [25]:
users.shape[0]

943

In [24]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [26]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [27]:
#Print only the occupation column

users.occupation

#or

users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [28]:
#How many different occupations are in this dataset?

users.occupation.nunique()

21

In [29]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [30]:
#Summarize the DataFrame.

users.describe() #Notice: by default, only the numeric columns are returned.

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [31]:
#Summarize only the occupation column

users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [32]:
#Summarize all the columns

users.describe(include = "all") #Notice: By default, only the numeric columns are returned.

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [33]:
#Discover what is the mean age per occupation
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [34]:
#For each occupation, calculate the minimum and maximum ages

users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

In [35]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [36]:
male_users=users[users['gender']=='M']
print(male_users)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
3         23      M         writer    32067
4         24      M     technician    43537
6         42      M      executive    98101
7         57      M  administrator    91344
...      ...    ...            ...      ...
936       24      M          other    32789
937       48      M       educator    98072
940       32      M  administrator    02215
941       20      M        student    97229
943       22      M        student    77841

[670 rows x 4 columns]

In [37]:
data={ 'Outcast': ['Sunny', 'Sunny', 'Overcast', 'Rain', 'Rain','Rain','Overcast','Sunny', 'Sunny', 'Rain','Sunny', 'Overcast','Overcast', 'Rain'],
      'Temperature': ['Hot', 'Hot','Hot', 'Mild', 'Cool', 'Cool','Cool', 'Mild', 'Cool','Mild','Mild','Mild', 'Hot','Mild'],
      'Humidity': ['High', 'High','High','High','Normal', 'Normal','Normal','High','Normal', 'Normal','Normal','High','Normal','High'], 
      'Windy': ['Weak', 'Strong', 'Weak','Weak','Weak','Strong','Strong','Weak','Weak','Weak','Strong','Strong','Weak','Strong' ],
      'Play': ['No', 'No', 'Yes','Yes','Yes','No','Yes','No', 'Yes','Yes','Yes','Yes','Yes','No']}

In [38]:
our_data=pd.DataFrame(data)
print('\n Dimension of the data = ', our_data.shape)
print('\n Number of Rows  = ', our_data.shape[0])
print('\n Number of Columns  = ', our_data.shape[1])

 Dimension of the data =  (14, 5)

 Number of Rows  =  14

 Number of Columns  =  5

In [39]:
print(our_data)

     Outcast Temperature Humidity   Windy Play
0      Sunny         Hot     High    Weak   No
1      Sunny         Hot     High  Strong   No
2   Overcast         Hot     High    Weak  Yes
3       Rain        Mild     High    Weak  Yes
4       Rain        Cool   Normal    Weak  Yes
5       Rain        Cool   Normal  Strong   No
6   Overcast        Cool   Normal  Strong  Yes
7      Sunny        Mild     High    Weak   No
8      Sunny        Cool   Normal    Weak  Yes
9       Rain        Mild   Normal    Weak  Yes
10     Sunny        Mild   Normal  Strong  Yes
11  Overcast        Mild     High  Strong  Yes
12  Overcast         Hot   Normal    Weak  Yes
13      Rain        Mild     High  Strong   No

In [40]:
Play_Class=our_data[our_data['Play']=='Yes']

print(Play_Class)

     Outcast Temperature Humidity   Windy Play
2   Overcast         Hot     High    Weak  Yes
3       Rain        Mild     High    Weak  Yes
4       Rain        Cool   Normal    Weak  Yes
6   Overcast        Cool   Normal  Strong  Yes
8      Sunny        Cool   Normal    Weak  Yes
9       Rain        Mild   Normal    Weak  Yes
10     Sunny        Mild   Normal  Strong  Yes
11  Overcast        Mild     High  Strong  Yes
12  Overcast         Hot   Normal    Weak  Yes

In [41]:
Dont_Play_Class=our_data[our_data['Play']=='No']
print(Dont_Play_Class)

   Outcast Temperature Humidity   Windy Play
0    Sunny         Hot     High    Weak   No
1    Sunny         Hot     High  Strong   No
5     Rain        Cool   Normal  Strong   No
7    Sunny        Mild     High    Weak   No
13    Rain        Mild     High  Strong   No

In [42]:
Num=our_data.shape[0]       # number of events
N_Yes=Play_Class.shape[0]
N_No=Dont_Play_Class.shape[0]
Probability_Yes= N_Yes / Num
Probability_No = N_No / Num

print('\n Total Events = ', Num)
print('\n Number of Yes = ', N_Yes)
print('\n Number of No = ', N_No)
print('\n Probability of YES = ', Probability_Yes)
print('\n Probability of No = ', Probability_No)

 Total Events =  14

 Number of Yes =  9

 Number of No =  5

 Probability of YES =  0.6428571428571429

 Probability of No =  0.35714285714285715

In [43]:
our_data.describe()

       Outcast Temperature Humidity Windy Play
count       14          14       14    14   14
unique       3           3        2     2    2
top       Rain        Mild     High  Weak  Yes
freq         5           6        7     8    9

In [44]:
# to get the features of our data

XX= Play_Class.columns
print(XX)

Index(['Outcast', 'Temperature', 'Humidity', 'Windy', 'Play'], dtype='object')

In [45]:
# to get the distinct features
for i in XX:
    print(i)

Outcast
Temperature
Humidity
Windy
Play

In [46]:
# to get the features, except the last column
XN=len(XX)
for i in range(XN-1):
    print(XX[i])

Outcast
Temperature
Humidity
Windy

In [47]:
# to get the unique elements of first column Pass Class

col=0
A=Play_Class[XX[col]].unique()
print(A)

['Overcast' 'Rain' 'Sunny']

In [48]:
# to get the number of unique elements of first column Pass Class

col=0
A=Play_Class[XX[col]].nunique()
print(A)

3

In [53]:
# to get the count of the unique elements of first column of Pass Class 
XX= Play_Class.columns
# XX= ['Outcast', 'Temperature', 'Humidity', 'Windy', 'Play']

col=0
n_unique_PC=Play_Class[XX[col]].nunique()    # number of distinct elements in first col
n_PC_total=Play_Class.shape[0]
PC=Play_Class[XX[col]].value_counts()      # the count of each of the distinct elements
prob_col_PC=[]

for i in range(n_unique_PC):
    temp1=PC[i]/n_PC_total
    prob_col_PC.append(temp1)
    
n_unique_DPC=Dont_Play_Class[XX[col]].nunique()    # number of distinct elements in first col
n_DPC_total=Dont_Play_Class.shape[0]
print(n_DPC_total)
DPC=Dont_Play_Class[XX[col]].value_counts()      # the count of each of the distinct elements
prob_col_DPC=[]
for i in range(n_unique_DPC):
    temp2=DPC[i]/n_DPC_total
    prob_col_DPC.append(temp2)


print('DPC',DPC)
print(PC)
print('Probability of Play Class',prob_col_PC)
print('Probability of Dont Play Class',prob_col_DPC)

5
DPC Sunny    3
Rain     2
Name: Outcast, dtype: int64
Overcast    4
Rain        3
Sunny       2
Name: Outcast, dtype: int64
Probability of Play Class [0.4444444444444444, 0.3333333333333333, 0.2222222222222222]
Probability of Dont Play Class [0.6, 0.4]

In [54]:
# to get the probability of every unique element in first column of Pass Class
print(B[0])

NameError: ignored

In [52]:
# to get the unique elements of Play Class

A=Play_Class['Outcast'].unique()
A.value_count
print(A)

AttributeError: ignored